system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 -0.05 -1.5)       //0
    (0.5 -0.05 -1.5)
    (0.5 0.05 -1.5)
    (-0.5 0.05 -1.5)
    (-0.5 -0.05 0.5)        //4
    (0.5 -0.05 0.5)
    (0.5 0.05 0.5)
    (-0.5 0.05 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 1 160) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    stationaryWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (2 6 5 1)
            (0 4 7 3)                
            //(1 5 4 0)
            //(3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    floatingObject
    {
        type wall;
        faces ();
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
