constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

motionSolver        sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (floatingObject);
    innerDistance   0.05;
    outerDistance   0.3;

    centreOfMass    (0 0 0);

    // Density of the solid
    rhoSolid        1200;

    // Cuboid mass
    mass            10;

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia (0.086 0.086 0.144)

    report          on;
    accelerationRelaxation 0.7;
    // accelerationDamping 0;

    solver
    {
        type Newmark;
    }

// ************************************************************************* //
